In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [3]:
dframe= DataFrame({'k1': ['X', 'X', 'Y', 'Y', 'Z'],
                  'k2': ['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                  'dataset': np.random.randn(5),
                  'dataset2': np.random.randn(5)})
dframe

    dataset  dataset2 k1     k2
0  0.716117  0.192637  X  alpha
1  0.323048  3.473067  X   beta
2 -0.131406 -0.333084  Y  alpha
3 -0.120278 -1.104056  Y   beta
4 -1.185845  1.306107  Z  alpha

In [5]:
group1= dframe['dataset'].groupby(dframe['k1'])
group1

In [6]:
group1.mean()

k1
X    0.519582
Y   -0.125842
Z   -1.185845
Name: dataset, dtype: float64

In [9]:
cities= np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month= np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])
dframe['dataset'].groupby([cities, month]).mean()

LA  FEB    0.323048
    JAN   -0.131406
NY  FEB   -0.120278
    JAN   -0.234864
Name: dataset, dtype: float64

In [10]:
dframe

    dataset  dataset2 k1     k2
0  0.716117  0.192637  X  alpha
1  0.323048  3.473067  X   beta
2 -0.131406 -0.333084  Y  alpha
3 -0.120278 -1.104056  Y   beta
4 -1.185845  1.306107  Z  alpha

In [11]:
dframe.groupby('k1').mean()

     dataset  dataset2
k1
X   0.519582  1.832852
Y  -0.125842 -0.718570
Z  -1.185845  1.306107

dframe.groupby(['k1', 'k2']).mean()

dframe.groupby(['k1', 'k2']).mean()

In [12]:
dframe.groupby(['k1', 'k2']).mean()

           dataset  dataset2
k1 k2
X  alpha  0.716117  0.192637
   beta   0.323048  3.473067
Y  alpha -0.131406 -0.333084
   beta  -0.120278 -1.104056
Z  alpha -1.185845  1.306107

In [13]:
dataset2_group= dframe.groupby(['k1', 'k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.192637
   beta   3.473067
Y  alpha -0.333084
   beta  -1.104056
Z  alpha  1.306107

In [14]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [15]:
for name, group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
    dataset  dataset2 k1     k2
0  0.716117  0.192637  X  alpha
1  0.323048  3.473067  X   beta


This is the Y group
    dataset  dataset2 k1     k2
2 -0.131406 -0.333084  Y  alpha
3 -0.120278 -1.104056  Y   beta


This is the Z group
    dataset  dataset2 k1     k2
4 -1.185845  1.306107  Z  alpha

In [16]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print('Key1= {} Key2= {}'.format(k1, k2))
    print(group)
    print('\n')

Key1= X Key2= alpha
    dataset  dataset2 k1     k2
0  0.716117  0.192637  X  alpha


Key1= X Key2= beta
    dataset  dataset2 k1    k2
1  0.323048  3.473067  X  beta


Key1= Y Key2= alpha
    dataset  dataset2 k1     k2
2 -0.131406 -0.333084  Y  alpha


Key1= Y Key2= beta
    dataset  dataset2 k1    k2
3 -0.120278 -1.104056  Y  beta


Key1= Z Key2= alpha
    dataset  dataset2 k1     k2
4 -1.185845  1.306107  Z  alpha

In [17]:
gr= dframe.groupby('k1')
gr.get_group('X')

    dataset  dataset2 k1     k2
0  0.716117  0.192637  X  alpha
1  0.323048  3.473067  X   beta

In [18]:
group_dict= dict(list(dframe.groupby('k1')))
group_dict['X']

    dataset  dataset2 k1     k2
0  0.716117  0.192637  X  alpha
1  0.323048  3.473067  X   beta

In [19]:
group_dict_axis1= dict(list(dframe.groupby(dframe.dtypes, axis= 1)))
group_dict_axis1

{dtype('float64'):     dataset  dataset2
 0  0.716117  0.192637
 1  0.323048  3.473067
 2 -0.131406 -0.333084
 3 -0.120278 -1.104056
 4 -1.185845  1.306107, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}